app/controllers/snapclass_controller.rb

INSERT INTO "snapclasses" ("teacher_id", "title", "description") VALUES (?, ?, ?)  [["teacher_id", 11], ["title", "Class 2"], ["description", "The second Snap! Class"]]
UPDATE "snapclasses" SET "teacher_id" = ? WHERE "snapclasses"."id" = ?  [["teacher_id", 2], ["id", 9]]
---
  def create
    @user = current_snapuser
    @class = Snapclass.create(class_params)
    @class.teacher_id = @user.teacher.id
    @class.save

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 13]]
SELECT "snapclasses".* FROM "snapclasses" WHERE "snapclasses"."teacher_id" = ?  [["teacher_id", 2]]
---
  def view_classes
    @classes = Teacher.find(params[:teacher_id]).snapclasses